challenges/rails-marathon/app/controllers/galleries_controller.rb

INSERT INTO "galleries" ("name", "city", "state", "zipcode", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "thing"], ["city", "place"], ["state", "other placew"], ["zipcode", 11112], ["description", "stuff"], ["created_at", 2017-03-02 21:29:17 UTC], ["updated_at", 2017-03-02 21:29:17 UTC]]
---
    def create
      @gallery = Gallery.new(gallery_params)

      if @gallery.save